<?php

class Df_Autotrading_Model_Method extends Df_Shipping_Model_Method {


	/**
	 * @override
	 * @return string
	 */
	public function getMethod () {
		return 'standard';
	}


	/**
	 * @override
	 * @return string
	 */
	public function getMethodTitle () {

		/** @var string $result  */
		$result = Df_Core_Const::T_EMPTY;

		if (!is_null ($this->getRequest()) && (0 !== $this->getTimeOfDeliveryMin())) {
			$result =
				sprintf (
					'%s'
					,
					$this->formatTimeOfDelivery (
						$this->getTimeOfDeliveryMin()
						,
						$this->getTimeOfDeliveryMax()
					)
				)
			;
		}

		df_result_string ($result);

		return $result;

	}




	/**
	 * @return int
	 */
	private function getTimeOfDeliveryMax () {

		/** @var int $result  */
		$result = df_a ($this->getTimeOfDeliveryAsArray(), 1, 0);

		df_result_integer ($result);

		return $result;

	}





	/**
	 * @return int
	 */
	private function getTimeOfDeliveryMin () {

		/** @var int $result  */
		$result = df_a ($this->getTimeOfDeliveryAsArray(), 0, 0);

		df_result_integer ($result);

		return $result;

	}


	
	
	
	/**
	 * @return array
	 */
	private function getTimeOfDeliveryAsArray () {
	
		if (!isset ($this->_timeOfDeliveryAsArray)) {
	
			/** @var array $result  */
			$result =
				df_a (
					df_a (
						$this->_deliveryTimeMap
						,
						mb_strtoupper ($this->getRequest()->getOriginCity())
						,
						array ()
					)
					,
					mb_strtoupper ($this->getRequest()->getDestinationCity())
					,
					array ()
				)
			;
	
	
			df_assert_array ($result);
	
			$this->_timeOfDeliveryAsArray = $result;
	
		}
	
	
		df_result_array ($this->_timeOfDeliveryAsArray);
	
		return $this->_timeOfDeliveryAsArray;
	
	}
	
	
	/**
	* @var array
	*/
	private $_timeOfDeliveryAsArray;	
	




	/** @var array */
	private $_deliveryTimeMap =
		/**
		 * Использованные регулярные выражения:
		 *
		 * 1) \t => ' => array (
		 * 2)  сут.\r\n => )\r\n,'
		 * 3) (\d+)\-(\d+) => $1, $2
		 */
		array (
			'МОСКВА' =>
				array (
					'АБАКАН' => array (11, 13)
					,'АНАПА' => array (3, 4)
					,'АРХАНГЕЛЬСК' => array (3, 4)
					,'АСТРАХАНЬ' => array (3, 4)
					,'БАРНАУЛ' => array (10, 12)
					,'БЕЛГОРОД' => array (1, 2)
					,'БЕЛОГОРСК' => array (7, 10)
					,'БИЙСК' => array (11, 13)
					,'БИРОБИДЖАН' => array (8, 11)
					,'БЛАГОВЕЩЕНСК' => array (8, 11)
					,'БРЯНСК' => array (1)
					,'ВЕЛИКИЙ НОВГОРОД' => array (1, 2)
					,'ВЛАДИВОСТОК' => array (8, 12)
					,'ВЛАДИМИР' => array (1)
					,'ВОЛГОГРАД' => array (2)
					,'ВОЛЖСК' => array (2)
					,'ВОЛЖСКИЙ' => array (3, 4)
					,'ВОЛОГДА' => array (1)
					,'ВОРОНЕЖ' => array (1)
					,'ДИМИТРОВГРАД' => array (2, 3)
					,'ЕКАТЕРИНБУРГ' => array (4)
					,'ИВАНОВО' => array (1)
					,'ИЖЕВСК' => array (2, 3)
					,'ИРКУТСК' => array (5, 8)
					,'ЙОШКАР-ОЛА' => array (1, 2)
					,'КАЗАНЬ' => array (1, 2)
					,'КАЛИНИНГРАД' => array (4, 5)
					,'КАЛУГА' => array (1)
					,'КЕМЕРОВО' => array (10, 12)
					,'КИРОВ' => array (2, 3)
					,'КОСТРОМА' => array (1)
					,'КРАСНОДАР' => array (2, 3)
					,'КРАСНОЯРСК' => array (10, 12)
					,'КУРГАН' => array (4, 5)
					,'КУРСК' => array (1)
					,'ЛИПЕЦК' => array (1)
					,'МАГНИТОГОРСК' => array (4, 5)
					,'МИАСС' => array (4)
					,'МИНСК' => array (1, 2)
					,'МУРМАНСК' => array (4, 5)
					,'НАБЕРЕЖНЫЕ ЧЕЛНЫ' => array (2, 3)
					,'НИЖНИЙ НОВГОРОД' => array (1)
					,'НИЖНИЙ ТАГИЛ' => array (6, 7)
					,'НИЖНЕВАРТОВСК' => array (7, 8)
					,'НОВОКУЗНЕЦК' => array (10, 12)
					,'НОВОРОССИЙСК' => array (3)
					,'НОВЫЙ УРЕНГОЙ' => array (9, 11)
					,'НОВОСИБИРСК' => array (8, 9)
					,'НОЯБРЬСК' => array (9, 11)
					,'ОКТЯБРЬСКИЙ' => array (3, 4)
					,'ОМСК' => array (6, 7)
					,'ОРЕНБУРГ' => array (3)
					,'ОРСК' => array (4)
					,'ОРЕЛ' => array (1)
					,'ПЕНЗА' => array (1)
					,'ПЕРМЬ' => array (3, 4)
					,'ПЕТРОЗАВОДСК' => array (3, 4)
					,'ПСКОВ' => array (2, 3)
					,'ПЯТИГОРСК' => array (4, 5)
					,'РОСТОВ-НА-ДОНУ' => array (2, 3)
					,'РЫБИНСК' => array (1)
					,'РЯЗАНЬ' => array (1)
					,'САНКТ-ПЕТЕРБУРГ' => array (1, 2)
					,'САМАРА' => array (2)
					,'САРАНСК' => array (1, 2)
					,'САРАТОВ' => array (1, 2)
					,'СМОЛЕНСК' => array (1)
					,'СОЧИ' => array (3, 4)
					,'СТАВРОПОЛЬ' => array (3)
					,'СТАРЫЙ ОСКОЛ' => array (2, 3)
					,'СТЕРЛИТАМАК' => array (3, 4)
					,'СЫКТЫВКАР' => array (3, 4)
					,'СУРГУТ' => array (8, 10)
					,'ТАГАНРОГ' => array (2, 3)
					,'ТАМБОВ' => array (1)
					,'ТВЕРЬ' => array (1)
					,'ТОЛЬЯТТИ' => array (2, 3)
					,'ТОМСК' => array (10, 12)
					,'ТУЛА' => array (1)
					,'ТЮМЕНЬ' => array (5, 6)
					,'УЛАН-УДЭ' => array (5, 8)
					,'УЛЬЯНОВСК' => array (2)
					,'УССУРИЙСК' => array (8, 12)
					,'УФА' => array (2, 3)
					,'ХАБАРОВСК' => array (8, 11)
					,'ХАНТЫ-МАНСИЙСК' => array (9, 11)
					,'ЧЕБОКСАРЫ' => array (1, 2)
					,'ЧЕЛЯБИНСК' => array (3, 4)
					,'ЧЕРЕПОВЕЦ' => array (1, 2)
					,'ЧИТА' => array (6, 9)
					,'ЭНГЕЛЬС' => array (2, 3)
					,'ЯРОСЛАВЛЬ' => array (1)
				)

			,
			'САНКТ-ПЕТЕРБУРГ' =>
				array (
					'АБАКАН' => array (13, 15)
					,'АНАПА' => array (6, 8)
					,'АРХАНГЕЛЬСК' => array (6, 7)
					,'АСТРАХАНЬ' => array (5, 6)
					,'БАРНАУЛ' => array (13, 15)
					,'БЕЛГОРОД' => array (4, 5)
					,'БЕЛОГОРСК' => array (9, 12)
					,'БИЙСК' => array (14, 16)
					,'БИРОБИДЖАН' => array (10, 13)
					,'БЛАГОВЕЩЕНСК' => array (10, 13)
					,'БРЯНСК' => array (4, 5)
					,'ВЕЛИКИЙ НОВГОРОД' => array (1, 2)
					,'ВЛАДИВОСТОК' => array (10, 14)
					,'ВЛАДИМИР' => array (3, 4)
					,'ВОЛГОГРАД' => array (4, 6)
					,'ВОЛЖСК' => array (6, 7)
					,'ВОЛЖСКИЙ' => array (6, 8)
					,'ВОЛОГДА' => array (1, 2)
					,'ВОРОНЕЖ' => array (2, 3)
					,'ДИМИТРОВГРАД' => array (6, 7)
					,'ЕКАТЕРИНБУРГ' => array (5, 7)
					,'ИВАНОВО' => array (2, 4)
					,'ИЖЕВСК' => array (5, 6)
					,'ИРКУТСК' => array (7, 10)
					,'ЙОШКАР-ОЛА' => array (4, 5)
					,'КАЗАНЬ' => array (3, 4)
					,'КАЛИНИНГРАД' => array (6, 7)
					,'КАЛУГА' => array (4, 5)
					,'КЕМЕРОВО' => array (13, 15)
					,'КИРОВ' => array (5, 7)
					,'КОСТРОМА' => array (3, 4)
					,'КРАСНОДАР' => array (5, 6)
					,'КРАСНОЯРСК' => array (12, 14)
					,'КУРГАН' => array (7, 8)
					,'КУРСК' => array (4, 5)
					,'ЛИПЕЦК' => array (4, 5)
					,'МАГНИТОГОРСК' => array (7, 8)
					,'МИАСС' => array (6, 7)
					,'МИНСК' => array (6, 7)
					,'МОСКВА' => array (2)
					,'МУРМАНСК' => array (3, 4)
					,'НАБЕРЕЖНЫЕ ЧЕЛНЫ' => array (5, 6)
					,'НИЖНИЙ НОВГОРОД' => array (2, 3)
					,'НИЖНИЙ ТАГИЛ' => array (6, 8)
					,'НИЖНЕВАРТОВСК' => array (12, 14)
					,'НОВОКУЗНЕЦК' => array (12, 14)
					,'НОВОРОССИЙСК' => array (6, 7)
					,'НОВОСИБИРСК' => array (11, 13)
					,'НОВЫЙ УРЕНГОЙ' => array (12, 14)
					,'НОЯБРЬСК' => array (13, 15)
					,'ОКТЯБРЬСКИЙ' => array (6, 8)
					,'ОМСК' => array (11, 13)
					,'ОРЕЛ' => array (4, 5)
					,'ОРЕНБУРГ' => array (6, 7)
					,'ОРСК' => array (7, 9)
					,'ПЕНЗА' => array (4, 5)
					,'ПЕРМЬ' => array (6, 7)
					,'ПЕТРОЗАВОДСК' => array (1, 2)
					,'ПСКОВ' => array (1, 2)
					,'ПЯТИГОРСК' => array (7, 8)
					,'РОСТОВ-НА-ДОНУ' => array (4, 5)
					,'РЫБИНСК' => array (3, 4)
					,'РЯЗАНЬ' => array (4, 5)
					,'САМАРА' => array (4, 5)
					,'САРАНСК' => array (5, 6)
					,'САРАТОВ' => array (5, 6)
					,'СМОЛЕНСК' => array (4, 5)
					,'СОЧИ' => array (6, 7)
					,'СТАВРОПОЛЬ' => array (6, 7)
					,'СТАРЫЙ ОСКОЛ' => array (3, 4)
					,'СТЕРЛИТАМАК' => array (6, 8)
					,'СУРГУТ' => array (12, 14)
					,'СЫКТЫВКАР' => array (5, 7)
					,'ТАГАНРОГ' => array (5, 6)
					,'ТАМБОВ' => array (4)
					,'ТВЕРЬ' => array (4, 5)
					,'ТОЛЬЯТТИ' => array (5, 7)
					,'ТОМСК' => array (12, 14)
					,'ТУЛА' => array (4, 5)
					,'ТЮМЕНЬ' => array (7, 8)
					,'УЛАН-УДЭ' => array (7, 10)
					,'УЛЬЯНОВСК' => array (5, 7)
					,'УССУРИЙСК' => array (10, 14)
					,'УФА' => array (4, 5)
					,'ХАБАРОВСК' => array (10, 13)
					,'ХАНТЫ-МАНСИЙСК' => array (12, 14)
					,'ЧЕБОКСАРЫ' => array (3, 4)
					,'ЧЕЛЯБИНСК' => array (5, 6)
					,'ЧЕРЕПОВЕЦ' => array (2, 3)
					,'ЧИТА' => array (8, 11)
					,'ЭНГЕЛЬС' => array (7, 8)
					,'ЯРОСЛАВЛЬ' => array (2, 3)
				)
			,
			'НОВОСИБИРСК' =>
				array (
					'АБАКАН' => array (3, 4)
					,'АНАПА' => array (12, 14)
					,'АРХАНГЕЛЬСК' => array (10, 12)
					,'АСТРАХАНЬ' => array (10, 12)
					,'БАРНАУЛ' => array (1)
					,'БЕЛГОРОД' => array (9, 10)
					,'БЕЛОГОРСК' => array (4, 6)
					,'БИЙСК' => array (3)
					,'БИРОБИДЖАН' => array (5, 7)
					,'БЛАГОВЕЩЕНСК' => array (15, 17)
					,'БРЯНСК' => array (9, 10)
					,'ВЕЛИКИЙ НОВГОРОД' => array (9, 10)
					,'ВЛАДИВОСТОК' => array (7, 9)
					,'ВЛАДИМИР' => array (8, 10)
					,'ВОЛГОГРАД' => array (8, 10)
					,'ВОЛЖСК' => array (9, 11)
					,'ВОЛЖСКИЙ' => array (9, 11)
					,'ВОЛОГДА' => array (9, 11)
					,'ВОРОНЕЖ' => array (9, 10)
					,'ДИМИТРОВГРАД' => array (8, 10)
					,'ЕКАТЕРИНБУРГ' => array (3, 4)
					,'ИВАНОВО' => array (8, 10)
					,'ИЖЕВСК' => array (6, 8)
					,'ИРКУТСК' => array (5, 8)
					,'ЙОШКАР-ОЛА' => array (8, 10)
					,'КАЗАНЬ' => array (6, 8)
					,'КАЛИНИНГРАД' => array (12, 14)
					,'КАЛУГА' => array (9, 10)
					,'КЕМЕРОВО' => array (1)
					,'КИРОВ' => array (7, 9)
					,'КОСТРОМА' => array (8, 10)
					,'КРАСНОДАР' => array (10, 12)
					,'КРАСНОЯРСК' => array (2)
					,'КУРГАН' => array (5, 7)
					,'КУРСК' => array (9, 10)
					,'ЛИПЕЦК' => array (9, 10)
					,'МАГНИТОГОРСК' => array (5, 7)
					,'МИАСС' => array (4, 6 )
					,'МИНСК' => array (9, 12)
					,'МОСКВА' => array (7, 8)
					,'МУРМАНСК' => array (12, 14)
					,'НАБЕРЕЖНЫЕ ЧЕЛНЫ' => array (6, 8)
					,'НИЖНИЙ НОВГОРОД' => array (7, 9)
					,'НИЖНИЙ ТАГИЛ' => array (5, 6)
					,'НИЖНЕВАРТОВСК' => array (6, 8)
					,'НОВОКУЗНЕЦК' => array (1)
					,'НОВОРОССИЙСК' => array (11, 13)
					,'НОВЫЙ УРЕНГОЙ' => array (7, 10)
					,'НОЯБРЬСК' => array (7, 9)
					,'ОКТЯБРЬСКИЙ' => array (6, 7)
					,'ОМСК' => array (1, 2)
					,'ОРЕЛ' => array (9, 10)
					,'ОРЕНБУРГ' => array (6, 8)
					,'ОРСК' => array (5, 7)
					,'ПЕНЗА' => array (7, 9)
					,'ПЕРМЬ' => array (5, 7)
					,'ПЕТРОЗАВОДСК' => array (10, 12)
					,'ПСКОВ' => array (10, 12)
					,'ПЯТИГОРСК' => array (11, 13)
					,'РОСТОВ-НА-ДОНУ' => array (9, 11)
					,'РЫБИНСК' => array (9, 11)
					,'РЯЗАНЬ' => array (9, 10)
					,'САНКТ-ПЕТЕРБУРГ' => array (8, 10)
					,'САМАРА' => array (6, 8)
					,'САРАНСК' => array (8, 10)
					,'САРАТОВ' => array (8, 10)
					,'СМОЛЕНСК' => array (9, 10)
					,'СОЧИ' => array (11, 13)
					,'СТАВРОПОЛЬ' => array (10, 12)
					,'СТАРЫЙ ОСКОЛ' => array (9, 10)
					,'СТЕРЛИТАМАК' => array (6, 7)
					,'СУРГУТ' => array (5, 6)
					,'СЫКТЫВКАР' => array (8, 10)
					,'ТАГАНРОГ' => array (10, 12)
					,'ТАМБОВ' => array (9, 10)
					,'ТВЕРЬ' => array (9, 10)
					,'ТОЛЬЯТТИ' => array (7, 9)
					,'ТОМСК' => array (1)
					,'ТУЛА' => array (9, 10)
					,'ТЮМЕНЬ' => array (3)
					,'УЛАН-УДЭ' => array (7, 10)
					,'УЛЬЯНОВСК' => array (9, 11)
					,'УССУРИЙСК' => array (6, 8)
					,'УФА' => array (5, 6)
					,'ХАБАРОВСК' => array (5, 7)
					,'ХАНТЫ-МАНСИЙСК' => array (7, 10)
					,'ЧЕБОКСАРЫ' => array (7, 9)
					,'ЧЕЛЯБИНСК' => array (3)
					,'ЧЕРЕПОВЕЦ' => array (9, 11)
					,'ЧИТА' => array (3, 5)
					,'ЭНГЕЛЬС' => array (7, 9)
					,'ЯРОСЛАВЛЬ' => array (7, 9)
				)
			,
			'ЕКАТЕРИНБУРГ' =>
				array (
					'АБАКАН' => array (6, 8)
					,'АНАПА' => array (7, 9)
					,'АРХАНГЕЛЬСК' => array (7, 9)
					,'АСТРАХАНЬ' => array (7, 9)
					,'БАРНАУЛ' => array (4, 6)
					,'БЕЛГОРОД' => array (6, 8)
					,'БЕЛОГОРСК' => array (11, 15)
					,'БИЙСК' => array (5, 7)
					,'БИРОБИДЖАН' => array (12, 16)
					,'БЛАГОВЕЩЕНСК' => array (12, 16)
					,'БРЯНСК' => array (5, 6)
					,'ВЕЛИКИЙ НОВГОРОД' => array (6, 7)
					,'ВЛАДИВОСТОК' => array (12, 17)
					,'ВЛАДИМИР' => array (5, 6)
					,'ВОЛГОГРАД' => array (5, 7)
					,'ВОЛЖСК' => array (5, 6)
					,'ВОЛЖСКИЙ' => array (6, 8)
					,'ВОЛОГДА' => array (5, 7)
					,'ВОРОНЕЖ' => array (6, 7)
					,'ДИМИТРОВГРАД' => array (5, 6)
					,'ИВАНОВО' => array (5, 7)
					,'ИЖЕВСК' => array (2)
					,'ИРКУТСК' => array (8, 11)
					,'ЙОШКАР-ОЛА' => array (4, 6)
					,'КАЗАНЬ' => array (2, 3)
					,'КАЛУГА' => array (6, 7)
					,'КЕМЕРОВО' => array (4, 6)
					,'КИРОВ' => array (2, 4)
					,'КОСТРОМА' => array (5, 6)
					,'КРАСНОДАР' => array (6, 8)
					,'КАЛИНИНГРАД' => array (7, 8)
					,'КРАСНОЯРСК' => array (5, 7)
					,'КУРГАН' => array (2, 4)
					,'КУРСК' => array (6, 7)
					,'ЛИПЕЦК' => array (6, 7)
					,'МАГНИТОГОРСК' => array (2, 4)
					,'МИАСС' => array (2)
					,'МИНСК' => array (7, 9)
					,'МОСКВА' => array (3, 5)
					,'МУРМАНСК' => array (8, 10)
					,'НАБЕРЕЖНЫЕ ЧЕЛНЫ' => array (4, 5)
					,'НИЖНИЙ НОВГОРОД' => array (4, 6)
					,'НИЖНИЙ ТАГИЛ' => array (1)
					,'НИЖНЕВАРТОВСК' => array (3, 4)
					,'НОВОКУЗНЕЦК' => array (5, 6)
					,'НОВОРОССИЙСК' => array (8, 9)
					,'НОВЫЙ УРЕНГОЙ' => array (4, 6)
					,'НОВОСИБИРСК' => array (3)
					,'НОЯБРЬСК' => array (4, 6)
					,'ОКТЯБРЬСКИЙ' => array (3, 5)
					,'ОМСК' => array (2)
					,'ОРЕНБУРГ' => array (3, 5)
					,'ОРЕЛ' => array (6, 7)
					,'ОРСК' => array (2, 4)
					,'ПЕНЗА' => array (4, 5)
					,'ПЕРМЬ' => array (1)
					,'ПЕТРОЗАВОДСК' => array (6, 7)
					,'ПСКОВ' => array (6, 7)
					,'ПЯТИГОРСК' => array (8, 10)
					,'РОСТОВ-НА-ДОНУ' => array (5, 7)
					,'РЫБИНСК' => array (5, 7)
					,'РЯЗАНЬ' => array (6, 7)
					,'САНКТ-ПЕТЕРБУРГ' => array (5, 6)
					,'САМАРА' => array (3, 4)
					,'САРАНСК' => array (5, 7)
					,'САРАТОВ' => array (5, 7)
					,'СМОЛЕНСК' => array (6, 7)
					,'СОЧИ' => array (7, 9)
					,'СТАВРОПОЛЬ' => array (7, 9)
					,'СТАРЫЙ ОСКОЛ' => array (6, 8)
					,'СТЕРЛИТАМАК' => array (3, 5)
					,'СЫКТЫВКАР' => array (4, 6)
					,'СУРГУТ' => array (2)
					,'ТАГАНРОГ' => array (6, 8)
					,'ТАМБОВ' => array (6, 7)
					,'ТВЕРЬ' => array (6, 7)
					,'ТОЛЬЯТТИ' => array (5, 6)
					,'ТОМСК' => array (4, 6)
					,'ТУЛА' => array (6, 7)
					,'ТЮМЕНЬ' => array (1)
					,'УЛАН-УДЭ' => array (9, 13)
					,'УЛЬЯНОВСК' => array (4, 5)
					,'УССУРИЙСК' => array (12, 17)
					,'УФА' => array (2)
					,'ХАБАРОВСК' => array (12, 17)
					,'ХАНТЫ-МАНСИЙСК' => array (4, 6)
					,'ЧЕБОКСАРЫ' => array (2, 3)
					,'ЧЕРЕПОВЕЦ' => array (5, 6)
					,'ЧИТА' => array (10, 14)
					,'ЧЕЛЯБИНСК' => array (1)
					,'ШАХТЫ' => array (7, 9)
					,'ЭНГЕЛЬС' => array (5, 6)
					,'ЯРОСЛАВЛЬ' => array (4, 5)					
				)
			
			,
			'НИЖНИЙ НОВГОРОД' =>
				array (
					'АБАКАН' => array (10, 11)
					,'АНАДЫРЬ' => array (6, 9)
					,'АНАПА' => array (5, 7)
					,'АРХАНГЕЛЬСК' => array (4, 5)
					,'АСТРАХАНЬ' => array (5, 7)
					,'БАРНАУЛ' => array (9, 11)
					,'БЕЛОГОРСК' => array (7, 10)
					,'БЕЛГОРОД' => array (3, 5)
					,'БИЙСК' => array (10, 12)
					,'БИРОБИДЖАН' => array (8, 11)
					,'БЛАГОВЕЩЕНСК' => array (8, 11)
					,'БРЯНСК' => array (3, 4)
					,'ВЕЛИКИЙ НОВГОРОД' => array ( 4, 7)
					,'ВЛАДИВОСТОК' => array (8, 12)
					,'ВЛАДИМИР' => array (1)
					,'ВОЛГОГРАД' => array (4, 6)
					,'ВОЛЖСК' => array (2, 3)
					,'ВОЛЖСКИЙ' => array (4, 6)
					,'ВОЛОГДА' => array (3, 4)
					,'ВОРОНЕЖ' => array (3, 5)
					,'ДИМИТРОВГРАД' => array (6)
					,'ЕКАТЕРИНБУРГ' => array (4, 5)
					,'ИВАНОВО' => array (3, 4)
					,'ИЖЕВСК' => array (5)
					,'ИРКУТСК' => array (5, 8)
					,'ЙОШКАР-ОЛА' => array (2, 3)
					,'КАЗАНЬ' => array (1, 2)
					,'КАЛИНИНГРАД' => array (4, 7)
					,'КАЛУГА' => array (3, 4)
					,'КЕМЕРОВО' => array (7, 9)
					,'КИРОВ' => array (3, 4)
					,'КОСТРОМА' => array (3, 4)
					,'КРАСНОДАР' => array (4)
					,'КРАСНОЯРСК' => array (8, 9)
					,'КУРГАН' => array (4, 6)
					,'КУРСК' => array (4, 5)
					,'ЛИПЕЦК' => array (2, 4)
					,'МАГАДАН' => array (6, 9)
					,'МАГНИТОГОРСК' => array (6, 7)
					,'МИАСС' => array (4, 6)
					,'МИНСК' => array (4)
					,'МОСКВА' => array (1, 2)
					,'МУРМАНСК' => array (7, 8)
					,'НАБЕРЕЖНЫЕ  ЧЕЛНЫ' => array (2, 4)
					,'НИЖНИЙ ТАГИЛ' => array (5, 7)
					,'НИЖНЕВАРТОВСК' => array (6, 8)
					,'НОВОКУЗНЕЦК' => array (8, 10)
					,'НОВОРОССИЙСК' => array (4, 5)
					,'НОВЫЙ УРЕНГОЙ' => array (10, 12)
					,'НОВОСИБИРСК' => array (8, 10)
					,'НОЯБРЬСК' => array (7, 10)
					,'ОКТЯБРЬСКИЙ' => array (3, 4)
					,'ОМСК' => array (7, 8)
					,'ОРЕНБУРГ' => array (5, 7)
					,'ОРЕЛ' => array (3, 5)
					,'ОРСК' => array (5, 7)
					,'ПЕНЗА' => array (1, 2)
					,'ПЕРМЬ' => array (3, 5)
					,'ПЕТРОЗАВОДСК' => array (4, 6)
					,'ПЕТРОПАВЛОВСК-КАМЧАТСКИЙ' => array (6, 9)
					,'ПСКОВ' => array (4, 5)
					,'ПЯТИГОРСК' => array (6)
					,'РОСТОВ-НА-ДОНУ' => array (4, 6)
					,'РЫБИНСК' => array (2, 4)
					,'РЯЗАНЬ' => array (3, 5)
					,'САНКТ-ПЕТЕРБУРГ' => array (2)
					,'САМАРА' => array (4, 5)
					,'САРАНСК' => array (2, 3)
					,'САРАТОВ' => array (2, 3)
					,'СМОЛЕНСК' => array (3, 4)
					,'СОЧИ' => array (4, 6)
					,'СТАВРОПОЛЬ' => array (6, 8)
					,'СТАРЫЙ ОСКОЛ' => array (3, 5)
					,'СТЕРЛИТАМАК' => array (3, 5)
					,'СЫКТЫВКАР' => array (4, 6)
					,'СУРГУТ' => array (6, 9)
					,'ТАГАНРОГ' => array (5, 7)
					,'ТАМБОВ' => array (3, 5)
					,'ТВЕРЬ' => array (3, 5)
					,'ТОЛЬЯТТИ' => array (5)
					,'ТОМСК' => array (9, 11)
					,'ТУЛА' => array (3, 5)
					,'ТЮМЕНЬ' => array (5, 6)
					,'УЛАН-УДЭ' => array (5, 8)
					,'УЛЬЯНОВСК' => array (2, 4)
					,'УССУРИЙСК' => array (8, 12)
					,'УФА' => array (2, 3)
					,'ХАБАРОВСК' => array (8, 12)
					,'ХАНТЫ-МАНСИЙСК' => array (9, 11)
					,'ЧЕБОКСАРЫ' => array (1)
					,'ЧЕРЕПОВЕЦ' => array (4, 5)
					,'ЧЕЛЯБИНСК' => array (3, 4)
					,'ЧИТА' => array (6, 9)
					,'ЭНГЕЛЬС' => array (1, 2)
					,'ЮЖНО-САХАЛИНСК' => array (6, 9)
					,'ЯКУТСК' => array (6, 9)
					,'ЯРОСЛАВЛЬ' => array (1, 2)					
				)
		)
	;






	/**
	 * @static
	 * @return string
	 */
	public static function getClass () {
		return 'Df_Autotrading_Model_Method';
	}


	/**
	 * Например, для класса Df_SalesRule_Model_Event_Validator_Process
	 * метод должен вернуть: «df_sales_rule/event_validator_process»
	 *
	 * @static
	 * @return string
	 */
	public static function getNameInMagentoFormat () {

		/** @var string $result */
		static $result;

		if (!isset ($result)) {
			$result = df()->reflection()->getModelNameInMagentoFormat (self::getClass());
		}

		return $result;
	}

}


